In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.2
1.19.2

## Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

   omset  operasional
0      6           16
1      6            6
2     10           18
3      7           11
4      5            8

In [4]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df
# karakter underscore dalam pemprograman python sering kali dikenal sebagai ignore character dan salah 1 kegunaannya bisa kita manfaatkan sebagai digital place holder

     omset  operasional
0   600000       160000
1   600000        60000
2  1000000       180000
3   700000       110000
4   500000        80000

## Membuat Kolom Tanggal

In [5]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index' : 'tanggal'})
df

C:\Users\Lingga Pratama\anaconda3\envs\linggapratama\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01   600000       160000
1 2000-01-02   600000        60000
2 2000-01-03  1000000       180000
3 2000-01-04   700000       110000
4 2000-01-05   500000        80000

## Melakukan Formatting Tampilan Data Frame

In [6]:
formatku = {'tanggal':'{:%d/%m/%y}',
            'operasional':'Rp {:.2f}', # :.2f maksudnya ingin menyertakan 2 digit extra dibelakang koma
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [7]:
type(laporan)

pandas.io.formats.style.Styler

In [8]:
laporan.hide_index()

In [9]:
laporan.set_caption('Data Omset dan Operasional') #cara menambahkan judul pada data frame

In [10]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')